<?php

namespace App\Repositories\RoleRepository;

use App\Models\{
    Role,
    Group,
    GroupRole,
    User,
    Store,
};
use Illuminate\Support\Collection;

interface RoleRepositoryInterface
{

    /***********************************************************
     * Create系
     ***********************************************************/

    /***********************************************************
     * Read系
     ***********************************************************/
    /**
     * ユーザーの属するストアロールを取得
     * @param User $user
     * @param int $storeId
     * @return Collection
     */
    public function getUserStoreRoles(User $user, int $storeId): Collection;

    /***********************************************************
     * Update系
     ***********************************************************/

    /***********************************************************
     * Delete系
     ***********************************************************/

    /***********************************************************
     * その他
     ***********************************************************/
}
