<?php

namespace App\Repositories\DeductionRepository;

use Illuminate\Support\Collection;
use App\Models\{
    Deduction,
    Store
};

interface DeductionRepositoryInterface
{
    /***********************************************************
     * Create系
     ***********************************************************/
    /**
     * 控除を登録
     * @param array $data
     */
    public function insertDeductions(array $data);

    /***********************************************************
     * Read系
     ***********************************************************/

    /***********************************************************
     * Update系
     ***********************************************************/

    /***********************************************************
     * Delete系
     ***********************************************************/
    /**
     * 勤怠IDに紐づく控除を削除する
     * @param int $attendanceId
     */
    public function deleteDeductions(int $attendanceId);

    /***********************************************************
     * その他
     ***********************************************************/
}
